gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
/**
 * @file sd_card.c
 * @author Gian Barta-Dougall
 * @brief This file handles all data being read from or written to the SD card.
 * The current features that this library supports are:
 * -
 * @version 0.1
 * @date 2023-01-12
 * @copyright Copyright (c) 2023
 *
 */

/* Library Includes */
#include <dirent.h>
#include <sys/stat.h>
#include <sys/types.h>
#include "driver/uart.h"

/* Personal Includes */
#include "sd_card.h"
#include "chars.h"
#include "hardware_config.h"
#include "esp32_uart.h"
#include "datetime.h"
#include "watchdog_utils.h"

/* Private Macros */

#define LOG_MSG_MAX_CHARACTERS 200
#define NULL_CHAR_LENGTH       1
#define DATE_TIME_DELIMITER    '_'
#define IMG_NUM_START_INDEX    3
#define IMG_NUM_END_CHARACTER  '-'

#define SD_CARD_FILE_READ  0
#define SD_CARD_FILE_WRITE 1

#define MAX_PATH_LENGTH 280

static const char* SD_CARD_TAG = "SD CARD:";

/* Private Variables */
int mounted          = FALSE;
uint16_t imageNumber = 0;

// Options for mounting the SD Card are given in the following
// configuration
static esp_vfs_fat_sdmmc_mount_config_t sdCardConfiguration = {
    .format_if_mount_failed = false,
    .max_files              = 5,
    .allocation_unit_size   = 16 * 1024,
};

sdmmc_card_t* card;

/* Private Function Declarations */
uint8_t sd_card_check_file_path_exists(char* filePath);
uint8_t sd_card_check_directory_exists(char* directory);

/* GOOD FUNCTIONS */

uint8_t sd_card_open_file(FILE** file, char* filePath, uint8_t sdCardCode, char* errMsg) {

    if ((*file = fopen(filePath, "rb")) != NULL) {
        return TRUE;
    }

    sprintf(errMsg, "Failed to open file %s. Error: '%s'\r\n", filePath, strerror(errno));
    return FALSE;
}

uint8_t sd_card_create_file(char* filePath, char* errMsg) {

    FILE* file;
    if ((file = fopen(filePath, "ab+")) == NULL) {
        sprintf(errMsg, "Failed to open file %s. Error: '%s'\r\n", filePath, strerror(errno));
        return FALSE;
    }

    fclose(file);
    return TRUE;
}

uint8_t sd_card_get_file_size(char* filePath, uint32_t* numBytes, char* errMsg) {

    FILE* file;

    // Try open the filepath in read mode
    if (sd_card_open_file(&file, filePath, SD_CARD_FILE_READ, errMsg) != TRUE) {
        return FALSE;
    }

    // Set pointer to end of the file
    fseek(file, 0L, SEEK_END);

    // Get the file length in bytes
    *numBytes = ftell(file);

    // Set file pointer to start of file
    fseek(file, 0L, SEEK_SET);

    fclose(file);

    return TRUE;
}

uint8_t sd_card_create_path(char* folderPath, bpk_t* Bpacket) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card could not open\n");
        return FALSE;
    }

    // Validate the path length
    if (chars_get_num_bytes(folderPath) > MAX_PATH_LENGTH) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Folder path > 50 characters\n");
        return FALSE;
    }

    // Try create folder
    char path[MAX_PATH_LENGTH + 1];
    struct stat st = {0};
    int fileFound  = 0;
    for (int i = 0; folderPath[i] != '\0'; i++) {

        path[i] = folderPath[i];

        // Finding a . signifies there are no more folders to be made, only one file
        if (path[i] == '.') {
            fileFound = 1;
        }

        if (path[i] == '/' || folderPath[i + 1] == '\0') {

            path[i + (folderPath[i + 1] == '\0')] = '\0';

            // Add SD card mount point to start of path
            char directory[MAX_PATH_LENGTH + 9];
            sprintf(directory, "%s/%s", MOUNT_POINT_PATH, path);

            // Try create the file if the end of the path is a file
            if (fileFound) {
                FILE* file = fopen(directory, "w");

                if (file == NULL) {
                    bpk_create_string_response(Bpacket, BPK_Code_Error, "File could not be made\n");
                    return FALSE;
                }

                break;
            }

            // Error if the directory does not exist and a new one could not be made
            if (stat(directory, &st) != 0 && mkdir(directory, 0700) != 0) {
                bpk_create_string_response(Bpacket, BPK_Code_Error, "Dir could not be made\n");
                return FALSE;
            }

            path[i] = '/';
        }
    }

    return TRUE;
}

uint8_t sd_card_list_dir(char* msg) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        sprintf(msg, "SD card could not open");
        return FALSE;
    }

    DIR* directory;
    directory = opendir(DATA_FOLDER_PATH_START_AT_ROOT);
    if (directory == NULL) {
        sprintf(msg, "Dir %s could not be opened", DATA_FOLDER_PATH_START_AT_ROOT);
        return FALSE;
    }

    // Loop through directory
    bpk_t Bpacket;
    Bpacket.Receiver = BPK_Addr_Receive_Stm32;
    Bpacket.Sender   = BPK_Addr_Send_Esp32;
    Bpacket.Request  = BPK_Req_List_Dir;
    Bpacket.Code     = BPK_Code_In_Progress;

    uint8_t index = 0;
    struct dirent* dirPtr;
    while ((dirPtr = readdir(directory)) != NULL) {

        // Copy the name of the folder into the folder structure string
        int k = 0;
        while (dirPtr->d_name[k] != '\0') {
            Bpacket.Data.bytes[index++] = dirPtr->d_name[k++];

            if (index == BPACKET_MAX_NUM_DATA_BYTES) {
                Bpacket.Data.numBytes = index;
                esp32_uart_send_bpacket(&Bpacket);
                index = 0;
            }
        }

        // Add a seperator
        Bpacket.Data.bytes[index++] = ':';

        if (index == BPACKET_MAX_NUM_DATA_BYTES) {
            Bpacket.Data.numBytes = index;
            esp32_uart_send_bpacket(&Bpacket);
            index = 0;
        }
    }

    // Send success bpacket with any remaining data
    Bpacket.Data.numBytes = index;
    Bpacket.Code          = BPK_Code_Success;
    esp32_uart_send_bpacket(&Bpacket);

    closedir(directory);
    sd_card_close();

    return TRUE;
}

uint8_t sd_card_write_to_file(char* filePath, char* string, bpk_t* Bpacket) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "SD Card could not open\0");
        return FALSE;
    }

