gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    // Validate the path length
    if (chars_get_num_bytes(filePath) > MAX_PATH_LENGTH) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Filepath > 50 characters\0");
        return FALSE;
    }

    // Add SD card mount point to start of path
    char directory[MAX_PATH_LENGTH + 9];
    sprintf(directory, "%s/%s", MOUNT_POINT_PATH, filePath);

    if (sd_card_create_path(directory, Bpacket) != TRUE) {
        return FALSE;
    }

    // Try open the file
    FILE* file = fopen(directory, "a+");

    if (file == NULL) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Filepath could not open\0");
        return FALSE;
    }

    fprintf(file, string);
    fclose(file);

    bpk_convert_to_response(Bpacket, BPK_Code_Success, 0, NULL);
    return TRUE;
}

uint8_t sd_card_search_num_images(uint16_t* numImages, bpk_t* Bpacket) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    // Confirm the directory for the images exists
    if (sd_card_create_path(DATA_FOLDER_PATH, Bpacket) != TRUE) {
        return FALSE;
    }

    // Open the directory where the images are stored
    DIR* directory;
    directory = opendir(DATA_FOLDER_PATH_START_AT_ROOT);
    if (directory == NULL) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Img dir could not open\0");
        return FALSE;
    }

    // Loop through each file and calculate the number of images
    struct dirent* dirPtr;
    *numImages = 0;
    while ((dirPtr = readdir(directory)) != NULL) {
        // Checking both img and IMG just incase as SD card is weird when it comes allowing/not allowing
        // lower case letters
        if (chars_contains(dirPtr->d_name, "img") == TRUE || chars_contains(dirPtr->d_name, "IMG") == TRUE) {
            *numImages += 1;
        }
    }

    return TRUE;
}

uint8_t sd_card_get_maximum_storage_capacity(uint16_t* maxStorageCapacityMb) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        return FALSE;
    }

    *maxStorageCapacityMb = (card->csd.capacity * card->csd.sector_size) / (1024 * 1024);

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_add_temp_to_csv(dt_datetime_t Datetime, float temp1, float temp2) {
    // TODO: redo
    // FILE* excelFile;
    // if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "r")) == NULL) {
    //     if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "w")) == NULL) {
    //         printf("Probelm creating the csv file");
    //         return FALSE;
    //     }
    //     fprintf(excelFile, "Date, Time, Temp 1, Temp 2");
    // } else {
    //     fclose(excelFile);
    //     if ((excelFile = fopen(DATA_FILE_PATH_START_AT_ROOT, "a")) == NULL) {
    //         printf("Probelm opeing the csv file");
    //         return FALSE;
    //     }
    // }
    // char timeString[10];
    // dt_time_to_string(timeString, Datetime.Time, TRUE);
    // fprintf(excelFile, "\r%i/%i/%i, %s, %s%i.%i, %s%i.%i", Datetime.Date.day, Datetime.Date.month,
    // Datetime.Date.year,
    //         timeString, Temp1.info == 0 ? "" : "-", Temp1.integer, Temp1.decimal, Temp2.info == 0 ? "" : "-",
    //         Temp2.integer, Temp2.decimal);

    // fclose(excelFile);

    return TRUE;
}

uint8_t sd_card_save_image(uint8_t* imageData, int imageLength, dt_datetime_t* Datetime, float temperature,
                           char* returnMsg) {

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        sprintf(returnMsg, "Could not open the SD card");
        return FALSE;
    }

    // Create formatted image number in the format of xxx
    char imgNumString[8];
    sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

    // Create formatted date time in the format yymmdd_hhmm
    char datetimeString[40];
    sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", Datetime->Date.year - 2000, Datetime->Date.month < 10 ? "0" : "",
            Datetime->Date.month, Datetime->Date.day < 10 ? "0" : "", Datetime->Date.day,
            Datetime->Time.hour < 10 ? "0" : "", Datetime->Time.hour, Datetime->Time.minute < 10 ? "0" : "",
            Datetime->Time.minute);

    // Create path for image
    char filePath[80];
    sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, DATA_FOLDER_PATH, imgNumString, datetimeString);

    FILE* imageFile = fopen(filePath, "wb");
    if (imageFile == NULL) {
        sprintf(returnMsg, "Image file failed to open");
        return FALSE;
    }

    for (int i = 0; i < imageLength; i++) {
        fputc(imageData[i], imageFile);
    }

    fclose(imageFile);

    imageNumber++;

    // Save the temperature data
    // if (sd_card_add_temp_to_csv(DateTime, Temp1, Temp2) != TRUE) {
    //     bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed to save temperature data\0");
    //     esp32_uart_send_bpacket(Bpacket);
    //     return FALSE;
    // }

    return TRUE;
}

uint8_t sd_card_save_image1(uint8_t* imageData, int imageLength, bpk_t* Bpacket) {

    // Extract the RTC and temperatre data from the Bpacket
    // cdt_dbl_16_t Temp1, Temp2;
    dt_datetime_t DateTime = {
        .Date.day    = 1,
        .Date.month  = 2,
        .Date.year   = 3,
        .Time.second = 1,
        .Time.minute = 1,
        .Time.hour   = 1,
    };
    // uint8_t result = wd_bpacket_to_photo_data(Bpacket, &DateTime, &Temp1, &Temp2);

    // if (result != TRUE) {
    //     char err[50];
    //     wd_get_error(result, err);
    //     bpk_create_string_response(Bpacket, BPK_Code_Error, err);
    //     esp32_uart_send_bpacket(Bpacket);
    //     return FALSE;
    // }

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Could not open the SD card\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

    // // Create the data folder path if required
    // if (sd_card_create_path(DATA_FOLDER_PATH, Bpacket) != TRUE) {
    //     bpk_create_sp(Bpacket, sender, Receiver, Request, BPK_Code_Error,
    //                       "Could not create path to data folder\0");
    //     esp32_uart_send_bpacket(Bpacket);
    //     return FALSE;
    // }

    // Create formatted image number in the format of xxx
    char imgNumString[8];
    sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

    // Create formatted date time in the format yymmdd_hhmm
    char datetimeString[40];
    sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", DateTime.Date.year - 2000, DateTime.Date.month < 10 ? "0" : "",
            DateTime.Date.month, DateTime.Date.day < 10 ? "0" : "", DateTime.Date.day,
            DateTime.Time.hour < 10 ? "0" : "", DateTime.Time.hour, DateTime.Time.minute < 10 ? "0" : "",
            DateTime.Time.minute);

    // Create path for image
    char filePath[80];
    sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, DATA_FOLDER_PATH, imgNumString, datetimeString);

    FILE* imageFile = fopen(filePath, "wb");
    if (imageFile == NULL) {
        bpk_create_string_response(Bpacket, BPK_Code_Error, "Image file failed to open\0");
        esp32_uart_send_bpacket(Bpacket);
        return FALSE;
    }

