gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    return TRUE;
}

uint8_t sd_card_log(char* fileName, char* message) {
    char name[30];
    sprintf(name, "%s", fileName); // Doing this so \0 is added to the end
    return sd_card_write(LOG_FOLDER_PATH_START_AT_ROOT, name, message);
}

/* GARBAGE CODE */

// uint8_t sd_card_list_directory(bpk_t* Bpacket, bpacket_char_array_t* bpacketCharArray) {

//     char* folderPath = bpacketCharArray->string;

//     // Try open the SD card
//     if (sd_card_open() != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card could not open\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     // Validate the path length
//     if (chars_get_num_bytes(folderPath) > MAX_PATH_LENGTH) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "Folder path > 50 chars\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     // Append the mounting point of the SD card to the folder path
//     char path[MAX_PATH_LENGTH + 9];
//     sprintf(path, "%s%s%s", MOUNT_POINT_PATH, folderPath[0] == '\0' ? "" : "/", folderPath);

//     DIR* directory;
//     directory = opendir(path);
//     if (directory == NULL) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "Filepath could not open\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     // Calculate number of characters in all folder names combined
//     uint16_t numChars = 0;
//     struct dirent* dirPtr;
//     while ((dirPtr = readdir(directory)) != NULL) {
//         numChars += strlen(dirPtr->d_name) + 2; // Adding 2 chars for \r\n
//     }

//     // Go back to the start of the directory
//     rewinddir(directory);

//     int i = 0;
//     bpk_swap_address(Bpacket);
//     Bpacket->Code          = BPK_Code_In_Progress;
//     Bpacket->Data.numBytes = BPACKET_MAX_NUM_DATA_BYTES;
//     int in                 = FALSE; // Variable just to know whether there was anything or not
//     while ((dirPtr = readdir(directory)) != NULL) {
//         in = 1;
//         // Copy the name of the folder into the folder structure string
//         int k = 0;
//         while (dirPtr->d_name[k] != '\0') {
//             Bpacket->Data.bytes[i++] = dirPtr->d_name[k];

//             if (i == BPACKET_MAX_NUM_DATA_BYTES) {
//                 esp32_uart_send_bpacket(Bpacket);
//                 i = 0;
//             }

//             k++;
//         }

//         Bpacket->Data.bytes[i++] = '\r';

//         if (i == BPACKET_MAX_NUM_DATA_BYTES) {
//             esp32_uart_send_bpacket(Bpacket);
//             i = 0;
//         }

//         Bpacket->Data.bytes[i++] = '\n';

//         if (i == BPACKET_MAX_NUM_DATA_BYTES) {
//             esp32_uart_send_bpacket(Bpacket);
//             i = 0;
//         }
//     }

//     if (i != 0) {
//         Bpacket->Code          = BPK_Code_Success;
//         Bpacket->Data.numBytes = i;
//         esp32_uart_send_bpacket(Bpacket);
//     }

//     if (in == FALSE) {
//         bpk_convert_to_response(Bpacket, BPK_Code_Success, 0, NULL);
//         esp32_uart_send_bpacket(Bpacket);
//     }

//     closedir(directory);
//     sd_card_close();

//     return TRUE;
// }

// uint8_t sd_card_read_settings(bpk_t* Bpacket) {

//     // Return error message if the SD card cannot be opened
//     if (sd_card_open() != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
//         return FALSE;
//     }

//     // Confirm the file path to the settings exists
//     if (sd_card_create_path(SETTINGS_FOLDER_PATH, Bpacket) != TRUE) {
//         sd_card_close();
//         return FALSE;
//     }

//     // Get the file size of the settings file. This needs to be done first because the file
//     // needs to be opened in read mode
//     uint32_t fileNumBytes = 0;
//     char errMsg[50];
//     if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &fileNumBytes, errMsg) != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, errMsg);
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     if (fileNumBytes == 0) {

//         switch (Bpacket->Request.val) {

//             case BPK_REQ_GET_CAMERA_SETTINGS:;

//                 bpk_t camSettingsBpacket;
//                 if (wd_camera_settings_to_bpacket(&camSettingsBpacket, Bpacket->Receiver, Bpacket->Sender,
//                                                   BPK_Req_Set_Camera_Settings, BPK_Code_Execute,
//                                                   &deafultCameraSettings) != TRUE) {
//                     bpk_create_string_response(Bpacket, BPK_Code_Error, "Setting deafult camera settings
//                     failed\r\n\0"); esp32_uart_send_bpacket(Bpacket); return FALSE;
//                 }

//                 if (sd_card_write_settings(&camSettingsBpacket) != TRUE) {
//                     bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed to write settings\r\n\0");
//                     esp32_uart_send_bpacket(Bpacket);
//                 }
//                 break;

//             case BPK_REQ_GET_CAMERA_CAPTURE_TIMES:;

//                 bpk_t deafultCaptureTimeSettingsBpacket;

//                 if (wd_capture_time_settings_to_bpacket(&deafultCaptureTimeSettingsBpacket, Bpacket->Receiver,
//                                                         Bpacket->Sender, Bpacket->Request, BPK_Code_Execute,
//                                                         &defaultCaptureTimeSettings) != TRUE) {
//                     bpk_create_string_response(Bpacket, BPK_Code_Error, "Setting deafult camera settings
//                     failed\r\n\0"); esp32_uart_send_bpacket(Bpacket); return FALSE;
//                 }

//                 sd_card_write_settings(&deafultCaptureTimeSettingsBpacket);

//                 break;

//             default:;

//                 bpk_create_string_response(Bpacket, BPK_Code_Error, "RF: Invalid Request!\r\n\0");
//                 esp32_uart_send_bpacket(Bpacket);
//                 return FALSE;
//         }

//         // Open the SD card again
//         if (sd_card_open() != TRUE) {
//             bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
//             return FALSE;
//         }
//     }

//     FILE* file;
//     if (sd_card_open_file(&file, SETTINGS_FILE_PATH_START_AT_ROOT, SD_CARD_FILE_READ, errMsg) != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, errMsg);
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     if (Bpacket->Request.val == BPK_Req_Get_Camera_Settings.val) {

//         wd_camera_settings_t cameraSettings;
//         cameraSettings.frameSize = (uint8_t)fgetc(file);

