gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
//         if (wd_camera_settings_to_bpacket(Bpacket, Bpacket->Receiver, Bpacket->Sender, Bpacket->Request,
//                                           BPK_Code_Success, &cameraSettings) != TRUE) {
//             esp32_uart_send_bpacket(Bpacket); // Send error back
//             // Clean up
//             fclose(file);
//             sd_card_close();
//             return FALSE;
//         }
//     }

//     if (Bpacket->Request.val == BPK_Req_Get_Camera_Capture_Times.val) {

//         // Set the cursor to the 1st index to skip the camera settings
//         fseek(file, 1, SEEK_CUR);
//         wd_camera_capture_time_settings_t captureTime;
//         // Seconds are required to be set to default otherwise they will assume
//         // the values of whatever is stored in that memory and will fail when
//         // being converted from a capture time to Bpacket
//         captureTime.startTime.second    = 0;
//         captureTime.startTime.minute    = fgetc(file);
//         captureTime.startTime.hour      = fgetc(file);
//         captureTime.endTime.second      = 0;
//         captureTime.endTime.minute      = fgetc(file);
//         captureTime.endTime.hour        = fgetc(file);
//         captureTime.intervalTime.second = 0;
//         captureTime.intervalTime.minute = fgetc(file);
//         captureTime.intervalTime.hour   = fgetc(file);

//         if (wd_capture_time_settings_to_bpacket(Bpacket, Bpacket->Receiver, Bpacket->Sender, Bpacket->Request,
//                                                 BPK_Code_Success, &captureTime) != TRUE) {
//             bpk_create_string_response(Bpacket, BPK_Code_Error,
//                                        "Capture time settings to Bpacket failed. SD Card read\r\n\0");

//             // Clean up
//             fclose(file);
//             sd_card_close();
//             return FALSE;
//         }
//     }

//     // Clean up
//     fclose(file);
//     sd_card_close();

//     return TRUE;
// }

// uint8_t sd_card_get_camera_settings(wd_camera_settings_t* cameraSettings) {

//     // Create a Bpacket with the correct information to read camera settings
//     bpk_t Bpacket;
//     bpk_create(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Esp32, BPK_Req_Get_Camera_Settings, BPK_Code_Execute,
//     0,
//                NULL);

//     if (sd_card_read_settings(&Bpacket) != TRUE) {
//         bpk_create_sp(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Esp32, BPK_Request_Message, BPK_Code_Error,
//                       "CS: Failed to read camera settings\r\n\0");
//         esp32_uart_send_bpacket(&Bpacket);
//         return FALSE;
//     }

//     // Convert the Bpacket to camera settings
//     if (wd_bpacket_to_camera_settings(&Bpacket, cameraSettings) != TRUE) {
//         bpk_create_sp(&Bpacket, BPK_Addr_Receive_Maple, BPK_Addr_Send_Esp32, BPK_Request_Message, BPK_Code_Error,
//                       "CS: Failed to parse camera settings\r\n\0");
//         esp32_uart_send_bpacket(&Bpacket);
//         return FALSE;
//     }

//     return TRUE;
// }

// uint8_t sd_card_write_settings(bpk_t* Bpacket) {

//     // Return error message if the SD card cannot be opened
//     if (sd_card_open() != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     FILE* file;
//     char errMsg[50];
//     if (sd_card_open_file(&file, SETTINGS_FILE_PATH_START_AT_ROOT, SD_CARD_FILE_WRITE, errMsg) != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, errMsg);
//         esp32_uart_send_bpacket(Bpacket);
//         sd_card_close();
//         return FALSE;
//     }

//     switch (Bpacket->Request.val) {

//         case BPK_REQ_SET_CAMERA_SETTINGS:;

//             wd_camera_settings_t cameraSettings;
//             if (wd_bpacket_to_camera_settings(Bpacket, &cameraSettings) != TRUE) {
//                 bpk_create_string_response(Bpacket, BPK_Code_Error, "Bpacket to camera settings failed\0");
//                 esp32_uart_send_bpacket(Bpacket);
//                 // Clean up
//                 fclose(file);
//                 sd_card_close();
//                 return FALSE;
//             }

//             fseek(file, 0L, SEEK_SET); // Ensure the file is pointing to first byte
//             fputc(cameraSettings.frameSize, file);

//             break;

//         case BPK_REQ_SET_CAMERA_CAPTURE_TIMES:;

//             wd_camera_capture_time_settings_t captureTime;
//             if (wd_bpacket_to_capture_time_settings(Bpacket, &captureTime) != TRUE) {
//                 bpk_create_string_response(Bpacket, BPK_Code_Error,
//                                            "Bpacket to capture time settings failed. SD Card write attempt\r\n\0");
//                 // Clean up
//                 fclose(file);
//                 sd_card_close();
//                 return FALSE;
//             }

//             // Skip the first byte as this is where the camera resolution is stored
//             fseek(file, 1, SEEK_CUR);
//             fputc(captureTime.startTime.minute, file);
//             fputc(captureTime.startTime.hour, file);
//             fputc(captureTime.endTime.minute, file);
//             fputc(captureTime.endTime.hour, file);
//             fputc(captureTime.intervalTime.minute, file);
//             fputc(captureTime.intervalTime.hour, file);

//             break;

//         default:;

//             bpk_create_string_response(Bpacket, BPK_Code_Error, "WF: Invalid Request!\r\n\0");
//             esp32_uart_send_bpacket(Bpacket);
//             return FALSE;
//     }

//     // Clean up
//     fclose(file);
//     sd_card_close();

//     return TRUE;
// }